# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CombinableElementArray..::..Append Method
CombinableElementArray Class See Also
---
Add the element to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	CombinableElement item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As CombinableElement _
)
```

Visual C++
---
```text
public:
virtual void Append(
	CombinableElement^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CombinableElementThe CombinableElement to be added.
# See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace